Autodesk.Navisworks.Api.DocumentParts.DocumentTool
The active tool in a Document

Autodesk.Navisworks.Api.DocumentParts.DocumentTool.Changed
Occurs when the current Tool has changed

Autodesk.Navisworks.Api.DocumentParts.DocumentTool.CustomToolPluginId
For the case where Autodesk.Navisworks.Api.DocumentParts.DocumentTool.Value is CustomToolPlugin,
this will return the the passed in ToolPlugin identifier.

Autodesk.Navisworks.Api.DocumentParts.DocumentTool.op_Implicit(Autodesk.Navisworks.Api.DocumentParts.DocumentTool)~Autodesk.Navisworks.Api.Tool
Conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentTool.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentTool.Set(Autodesk.Navisworks.Api.Tool)
Explicit method that sets Autodesk.Navisworks.Api.DocumentParts.DocumentTool.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentTool.SetCustomToolPlugin(Autodesk.Navisworks.Api.Plugins.ToolPlugin)
Sets the current Tool to a custom ToolPlugin.
toolPlugin:
Loaded ToolPlugin
Throws System.ArgumentNullException:
Argument 'toolPlugin' is null

Autodesk.Navisworks.Api.DocumentParts.DocumentTool.ToTool
Explicit form of conversion operator returning Autodesk.Navisworks.Api.DocumentParts.DocumentTool.Value

Autodesk.Navisworks.Api.DocumentParts.DocumentTool.Value
The value of the active Tool within the document
Attempts to set Autodesk.Navisworks.Api.DocumentParts.DocumentTool.Value to CustomToolPlugin will be ignored.
Throws System.InvalidOperationException:
This method cannot be used with 'CustomToolPlugin', use SetCustomToolPlugin instead